package com.android.pizzarecipes2;

public class Utils {

    public static final String PIZZA_1_TITLE = "Дрожжевая пицца с колбасой, помидорами и сыром";
    public static final String PIZZA_1_RECIPE = "Подготовьте все необходимые ингредиенты для приготовления дрожжевой пиццы с колбасой, помидорами и сыром.\n" +
            "\n" +
            "Приготовьте дрожжевое тесто для пиццы. В миску налейте тёплую кипячёную воду, всыпьте сахар и сухие дрожжи. Перемешайте.\n" +
            "\n" +
            "Затем влейте подсолнечное, а лучше оливковое масло. Всыпьте соль, снова перемешайте.\n" +
            "\n" +
            "Частями подсыпая муку, замесите тесто. Соберите тесто в шар, накройте миску чистым кухонным полотенцем и поставьте в тёплое место на 40 минут.\n" +
            "\n" +
            "Подошедшее дрожжевое тесто для пиццы обомните.\n" +
            "\n" +
            "На присыпанном мукой листе пергамента для выпечки раскатайте тесто в тонкий круг диаметром примерно 25 см.\n" +
            "\n" +
            "Смажьте основу для пиццы кетчупом или любым другим соусом для пиццы.\n" +
            "\n" +
            "Колбасу очистите от оболочки, нарежьте тоненькими кружочками или ломтиками. Выложите колбасу на тесто, смазанное соусом.\n" +
            "\n" +
            "Сладкий красный перец нарежьте маленькими кубиками и разложите на ломтики колбасы и между ними.\n" +
            "\n" +
            "Затем в хаотичном порядке разложите на пицце кусочки сливочного масла.\n" +
            "\n" +
            "Помидор нарежьте тоненькими ломиками, вырезав при этом плодоножку. Разложите ломтики помидора на пиццу.\n" +
            "\n" +
            "Твёрдый сыр натрите на крупной тёрке, посыпьте им начинку пиццы.\n" +
            "\n" +
            "Выпекайте домашнюю пиццу в предварительно разогретой до 200 градусов духовке около 15 минут (режим “Пицца” или нагрев снизу+вентиляционный нагрев).\n" +
            "\n" +
            "Готовую пиццу на дрожжевом тесте по желанию посыпьте нарезанным зеленым луком или другой зеленью.";
    public static final String PIZZA_2_TITLE = "Домашняя пицца на тонком бездрожжевом тесте";
    public static final String PIZZA_2_RECIPE = "Яйцо, соль, сахар и растительное масло взбиваем венчиком до получения однородной массы.\n" +
            "\n" +
            "Добавляем 200 мл воды и хорошо перемешиваем.\n" +
            "\n" +
            "В полученную массу просеиваем 2 стакана муки и замешиваем упругое тесто. Оно не должно быть липким.\n" +
            "Желательно оставить тесто примерно на час (или на большее время в холодильнике), завернув его в пищевую пленку.\n" +
            "\n" +
            "Раскатываем тесто для пиццы в круг толщиной 0,5 см.\n" +
            "Смазываем любимым томатным соусом и раскладываем начинку. Начинка может быть любой, на ваш вкус.\n" +
            "\n" +
            "Пиццу выпекаем в разогретой духовке в течение примерно 20 минут при температуре 180 градусов.";
    public static final String PIZZA_3_TITLE = "Домашняя пицца \"Как я люблю\"";
    public static final String PIZZA_3_RECIPE = "Все ингредиенты рассчитаны на 2 пиццы.\n" +
            "Тесто для пиццы приготовлено по рецепту Джейми Оливера (ссылка на рецепт - в списке продуктов).\n" +
            "Томатный соус у меня домашний, со сладким перцем и чесноком.\n" +
            "\n" +
            "Одну часть теста помещаем на лист, покрытый пергаментной бумагой, слегка смазанной маслом, и руками распределяем тесто по кругу диаметром 30 см.\n" +
            "\n" +
            "Смазываем томатным соусом, оставляя края нетронутыми.\n" +
            "\n" +
            "Посыпаем сухими итальянскими травами.\n" +
            "Сверху натираем немного сыра.\n" +
            "\n" +
            "Следующим слоем выкладываем ветчину, нарезанную полосками.\n" +
            "\n" +
            "Выкладываем оливки.\n" +
            "\n" +
            "Обильно посыпаем натертым сыром.\n" +
            "\n" +
            "Помещаем пиццу в духовку, разогретую до температуры 190 градусов, на 15-20 минут, в зависимости от духовки.";
    public static final String PIZZA_4_TITLE = "\"Молниеносная\" пицца из бездрожжевого теста";
    public static final String PIZZA_4_RECIPE = "Подготовим продукты для пиццы.\n" +
            "Перед тем как начнем готовить, включим духовку, пусть разогревается.\n" +
            "\n" +
            "Готовим быстрое тесто для пиццы. Для этого муку смешиваем с солью и разрыхлителем. Вливаем масло и воду.\n" +
            "\n" +
            "Замешиваем 5-7 минут, тесто получается мягким и слегка липнет к рукам. Сразу делим на две равные части - получится две пиццы.\n" +
            "\n" +
            "Выкладываем на смазанный маслом и присыпанный мукой противень (у меня дно от разъемной формы диаметром 24 см), выравниваем и формируем небольшие бортики.\n" +
            "\n" +
            "Готовим начинку для пиццы. Для этого лук нарезаем кольцами, сладкий перец - тонкой соломкой. Колбасу режем кружочками, а сыр трем на крупной терке.\n" +
            "\n" +
            "Смазываем тесто густым томатным соусом (у нас домашний), посыпаем щепоткой орегано и выкладываем начинку. Сверху посыпаем сыром.\n" +
            "\n" +
            "Выпекается быстрая пицца из бездрожжевого теста в разогретой духовке минут 15-20 при температуре 230 градусов. Следите за пиццей, у всех духовки разные.";
    public static final String PIZZA_5_TITLE = "Домашняя пицца на дрожжевом тесте";
    public static final String PIZZA_5_RECIPE = "Приготовление начнём с теста для пиццы.\n" +
            "Молоко подогреваем до чуть тёплого состояния.\n" +
            "\n" +
            "В первую очередь активируем дрожжи (готовим быструю опару): в тёплое молоко добавляем дрожжи, сахар и 1 ст. ложку муки. Перемешиваем. Даём опаре постоять в тёплом месте 5-7 минут.\n" +
            "\n" +
            "Соединяем в чашке муку с солью.\n" +
            "\n" +
            "К муке добавляем опару.\n" +
            "\n" +
            "Замешиваем тесто. Когда тесто соберётся в комок, добавляем растительное масло. Хорошо вымешиваем тесто, минут 10.\n" +
            "\n" +
            "Тесто перекладываем в чашку и накрываем крышкой или плёнкой. Даём тесту подняться (увеличиться вдвое) в тёплом месте, в течение примерно 1 часа.\n" +
            "\n" +
            "За это время соберём начинку для пиццы.\n" +
            "Куриную грудку или грудку индейки заранее нужно замариновать в ваших любимых специях и запечь в духовке при 200 градусах в течение 25-30 минут. Сардельку варим в течение 5 минут и очищаем.\n" +
            "\n" +
            "В первую очередь готовим томатный соус. Для этого томатную пасту прогреваем в небольшом количестве растительного масла. Добавляем итальянские травы и тимьян и прогреваем ещё минуту. В конце добавляем буквально пару столовых ложек воды, чтобы получился соус.\n" +
            "Даём томатному соусу немного остыть.\n" +
            "\n" +
            "Мясо и колбаску нарезаем тонкими пластинами. Сардельку нарезаем полукружочками.\n" +
            "\n" +
            "Маслины нарезаем колечками. Помидоры нарезаем тонкими кружочками. Главное, не дать съесть начинку раньше времени. :)\n" +
            "\n" +
            "Включаем духовку и разогреваем до максимальной температуры (у меня 230 градусов).\n" +
            "Тесто раскатываем в прямоугольник.\n" +
            "\n" +
            "Противень застилаем пергаментной бумагой.\n" +
            "Тесто переносим на противень и распределяем его руками, делаем небольшие бортики.\n" +
            "\n" +
            "На тесто выкладываем соус и распределяем ложкой.\n" +
            "\n" +
            "Сверху выкладываем начинку слоями.\n" +
            "Сначала распределяем мясо, колбаску и сардельку.\n" +
            "\n" +
            "Затем добавляем горошек, оливки и помидоры.\n" +
            "Сыр натираем на крупной тёрке и посыпаем пиццу. У меня небольшой кусочек сыра, поэтому я посыплю пиццу в конце выпекания (за 5 минут до готовности), вы можете посыпать пиццу сыром сразу.\n" +
            "\n" +
            "Готовим пиццу в духовке при температуре 230 градусов минут 15.";
    public static final String PIZZA_6_TITLE = "Быстрая пицца с колбасой и сыром";
    public static final String PIZZA_6_RECIPE = "Подготавливаем необходимые ингредиенты для приготовления быстрого теста для пиццы.\n" +
            "\n" +
            "Начинку для пиццы можно взять любой. У меня кетчуп, колбаса, маслины и твёрдый сыр.\n" +
            "\n" +
            "Колбаску очищаем от оболочки, нарезаем тонкими кружочками или ломтиками.\n" +
            "Маслины нарезаем колечками.\n" +
            "Сыр натираем на крупной тёрке или нарезаем тонкой соломкой.\n" +
            "\n" +
            "В тёплую воду добавляем сахар и сухие дрожжи.\n" +
            "\n" +
            "Перемешиваем и оставляем для активации дрожжей на 7-8 минут.\n" +
            "\n" +
            "В отдельную миску просеиваем муку. Добавляем соль и перемешиваем.\n" +
            "\n" +
            "В муке делаем углубление, вливаем подошедшие дрожжи и перемешиваем.\n" +
            "\n" +
            "Замешиваем мягкое тесто. Вымешиваем 3-4 минуты - и тесто для пиццы готово.\n" +
            "В духовке устанавливаем перевёрнутый противень или камень для пиццы.\n" +
            "Чтобы у пиццы не пересыхали бортики, а сама пицца лучше подрумянилась, можно первые 3-4 минуты выпекать её с паром - для этого внизу духовки нужно установить (в нормальном положении) другой противень.\n" +
            "Включаем духовку разогреваться до 260 градусов.\n" +
            "\n" +
            "Из пергаментной бумаги для выпечки вырезаем круг диаметром чуть больше 30 см.\n" +
            "Пиццу будем формировать на пергаменте.\n" +
            "Вначале тесто растягиваем руками на весу. Затем выкладываем тесто на пергамент и раскатываем припылённой мукой скалкой в лепёшку диаметром около 30 см.\n" +
            "\n" +
            "Смазываем основу пиццы густым кетчупом, оставляя края свободными.\n" +
            "\n" +
            "Выкладываем подготовленную начинку (колбасу и маслины). Желательно не перегружать ею пиццу.\n" +
            "\n" +
            "Сверху посыпаем пиццу натёртым сыром.\n" +
            "\n" +
            "Пиццу вместе с пергаментом перекладываем на раскалённый противень или на раскалённый камень для хлеба/пиццы.\n" +
            "\n" +
            "Края пиццы можно слегка смазать оливковым или другим растительным маслом. Отправляем пиццу в разогретую до 260 градусов духовку.\n" +
            "Если выпекаем пиццу с паром, вливаем в нижний раскалённый противень половину стакана крутого кипятка и сразу же закрываем духовку.\n" +
            "Выпекаем пиццу до зарумянивания примерно 8 минут.\n" +
            "\n" +
            "Как только сыр расплавится, а бортики пиццы станут румяными, достаём пиццу из духовки.\n" +
            "\n" +
            "Пицца с колбасой и сыром готова.\n" +
            "\n" +
            "Быструю пиццу с колбасой и сыром нарезаем порционно и сразу подаём к столу. Тесто у пиццы по этому рецепту вкусное, мягкое и воздушное.";
    public static final String PIZZA_7_TITLE = "Пицца с ветчиной и грибами";
    public static final String PIZZA_7_RECIPE = "Приготовить тесто для пиццы с ветчиной и грибами. В теплой воде растворить соль и сахар, добавить муку, дрожжи и растительное масло. Замесить тесто. Дождаться, когда тесто увеличится вдвое.\n" +
            "Шаг 2\n" +
            "Пицца с ветчиной и грибами, нарежьте ингредиенты\n" +
            "Грибы и лук для начинки пиццы с ветчиной почистить, затем нарезать. В сковороде нагреть растительное масло. Выложить в нее подготовленные грибы с луком и, периодически помешивая, слегка обжарить. Дать остыть.\n" +
            "Шаг 3\n" +
            "Пицца с ветчиной и грибами, раскатайте тесто круг\n" +
            "Большой широкий противень для приготовления пиццы смазать растительным маслом или выстелить бумагой для выпечки. Раскатать тесто в большой тонкий круг прямо на противне.\n" +
            "Шаг 4\n" +
            "Пицца с ветчиной и грибами, смажьте пиццу\n" +
            "Смазать тесто кетчупом с помощью кулинарной кисточки. Затем выложить на тесто для пиццы остывшие жаренные с луком грибы и разровнять, чтобы они распределились по поверхности равномерно.\n" +
            "Шаг 5\n" +
            "Пицца с ветчиной и грибами, выложите помидоры и ветчину\n" +
            "Ветчину для пиццы нарезать небольшими ломтиками. Помидоры вымыть и хорошо обсушить. Удалить основания плодоножек. Плоды нарезать кружочками или ломтиками. Затем вместе с ветчиной распределить по тесту с луком и грибами.\n" +
            "Шаг 6\n" +
            "Пицца с ветчиной и грибами, добавьте сыр\n" +
            "Сыр натереть на крупной или средней терке. Равномерно распределить на пицце с ветчиной и грибами. Можно посыпать сушеными пряными травами по вкусу или свежим мелко нарезанным базиликом. Выпекать пиццу с ветчиной и грибами в духовке при 200 градусах до тех пор, пока сыр не растопится и не образуется румяная корочка.";
    public static final String PIZZA_8_TITLE = "Пицца пепперони в домашних условиях";
    public static final String PIZZA_8_RECIPE = "В глубокую миску наливаем 1 стакан чуть тёплой воды. Добавляем 1 ч. ложку соли, 1 ч. ложку сахара и 10 г сухих дрожжей. Перемешиваем содержимое миски и оставляем на 10 минут, чтобы дрожжи заработали.\n" +
            "\n" +
            "2,5 стакана муки просеиваем через сито. Вливаем в муку 3 ст. ложки оливкового масла и раствор дрожжей.\n" +
            "Замешиваем тесто. Разумеется, сперва удобнее это делать ложкой, а когда тесто достаточно загустеет, продолжаем месить его руками (не менее 5 минут).\n" +
            "Когда тесто вымешано, кладем его в глубокую миску, смазываем оливковым маслом и накрываем влажным полотенцем. Ставим дрожжевое тесто в тёплое место, чтобы оно подошло, на один час.\n" +
            "\n" +
            "Пока тесто подходит, готовим соус для пиццы. Для этого очищаем и мелко нарезаем 2 зубчика чеснока. На разогретую сковороду наливаем растительное масло. Выливаем на сковороду 400 мл протертых помидоров в собственном соку. Сразу же добавляем к томатам соль, свежемолотый перец и чеснок. Перемешиваем все ингредиенты и доводим соус до кипения. Пробуем его на вкус. Иногда бывает, что протертые помидоры попадаются с кислинкой, поэтому в соус необходимо добавить сахар для баланса вкуса. Советов, сколько добавлять сахара, я давать не буду, делайте на свой вкус.\n" +
            "Настало время одарить соус настоящими итальянскими ароматами! Для этого отправляем в сковороду 1 ч. ложку орегано и 1 ч. ложку базилика. Перемешиваем. Уменьшаем огонь и доводим соус до желаемой консистенции. На это уйдёт около 15 минут.\n" +
            "\n" +
            "Чтобы не терять времени даром, подготавливаем сыр - натираем на терке. Для того чтобы пицца получилась максимально вкусной, я использую два вида сыра. Первый – всегда неизменный, это моцарелла для пиццы. Именно для пиццы, а не в рассоле. Связано это с тем, что в ней ярче выражен вкус сыра, поэтому в пицце мне она нравится больше. Второй сыр рекомендую добавить тот, который вам больше нравится. В моём случае это гауда.\n" +
            "\n" +
            "Мы подошли к самому важному ингредиенту пиццы пепперони - это колбаса пепперони. Найти её можно не везде, но без неё данная пицца не получится, поэтому сделать это необходимо!\n" +
            "Нарезаем колбасу тонкими ломтиками.\n" +
            "\n" +
            "К этому моменту тесто уже должно было взойти. Извлекаем его из миски и разделяем на 3 части (ингредиентов, приведенных в данном рецепте, хватит на 3 небольшие пиццы).\n" +
            "Раскатываем каждую часть теста в основу для пиццы. Обрезаем тесто по форме для запекания - основа пиццы приобретет правильную круглую форму и пицца будет выглядеть намного привлекательнее.\n" +
            "\n" +
            "Духовку разогреваем до максимальной температуры. В моём случае это 280 градусов.\n" +
            "Приступаем к сборке пиццы. Припыляем форму для выпечки мукой, чтобы тесто не приставало к ней. Выкладываем основу для пиццы, смазываем приготовленным соусом и равномерно распределяем его, при этом 1,5 см до края основы не должны быть покрыты соусом. Посыпаем соус смесью натертых сыров. Выкладываем ломтики пепперони.\n" +
            "\n" +
            "Помещаем пиццу в духовку. При температуре 280 градусов пицца пепперони будет выпекаться у меня в духовке около 6 минут.\n" +
            "Когда пицца будет готова, очень рекомендую полить её сверху небольшим количеством оливкового масла и посыпать орегано.";
    public static final String PIZZA_9_TITLE = "Пицца для мужа";
    public static final String PIZZA_9_RECIPE = "1. Чеснок почистить, нарезать тоненькими ломтиками и залить растительным маслом. Перемешать. Пока будем готовить тесто, начинку и соус, чесночное масло настоится. (Можно приготовить его заранее.)\n" +
            "\n" +
            "2. Дрожжи необходимо растворить в теплом (именно теплом - не холодном и не горячем) молоке или воде, помешивая. Когда дрожжи полностью растворятся, добавляем соль и сахар. Затем добавляем просеянную муку. Накрываем дрожжевое тесто для пиццы полотенцем и оставляем неподалеку от источника тепла на полчаса.\n" +
            "\n" +
            "3. Подготавливаем начинку. Лук режем тонкими полукольцами. Сыр трем на крупной терке. Сосиски режем на длинные ломтики (по диагонали) толщиной 5-7 мм.\n" +
            "\n" +
            "4. Готовим соус. Помидоры превращаем в пюре, предварительно опустив их в кипяток на минуту и сняв с них кожицу. Добавляем к томатам оставшиеся составляющие для соуса. Из масла вылавливаем чеснок (он нам не нужен) и выливаем масло в соус. Все хорошенько перемешиваем.\n" +
            "\n" +
            "5. Готовое тесто для пиццы раскатываем скалкой в не очень толстый пласт. Противень припорашиваем мукой и кладем на него основу для пиццы. Смазываем ее соусом, потом выкладываем лук, затем выкладываем сосиски и сверху присыпаем все сыром.\n" +
            "\n" +
            "6. Пиццу ставим в заранее разогретую до 180 градусов духовку минут на 20. Готовность теста проверяем зубочисткой. При необходимости помещаем пиццу еще ненадолго в печь.";
    public static final String PIZZA_10_TITLE = "Пицца на сковороде за 10 минут";
    public static final String PIZZA_10_RECIPE = "Для приготовления пиццы на сковороде за 10 минут подготовим продукты по списку.\n" +
            "\n" +
            "Ингредиенты для пиццы за 10 минут на сковороде\n" +
            "Соединяем яйцо, сметану, майонез и перемешиваем.\n" +
            "Смешать яйцо, сметану и майонез\n" +
            "Добавляем муку, перемешиваем, чтобы не осталось комочков.\n" +
            "Всыпать муку\n" +
            "Сковороду смазываем небольшим количеством растительного масла. Выкладываем тесто, разравниваем по дну и закрываем сковороду крышкой.\n" +
            "Выложить тесто на сковороду\n" +
            "Ставим на небольшой огонь, тем временем нарезаем колбасу и помидоры, трем сыр. Как только тесто схватится немного (примерно 3-4 минуты), смазываем кетчупом.\n" +
            "Смазать кетчупом\n" +
            "Выкладываем кружочки колбасы и по желанию лук.\n" +
            "Положить колбасу и лук\n" +
            "Накрываем колбасу дольками помидор.\n" +
            "Положить помидоры\n" +
            "Посыпаем тертым сыром и возвращаем сковороду на огонь.\n" +
            "Посыпать сыром\n" +
            "Готовим под крышкой до расплавления сыра, примерно 6-7 минут.\n" +
            "\n";
}

